#include<stdio.h>
#include<windows.h>
#include<conio.h>
int main()
{
	const int hang = 20;
	const int lie = 20;
out:char a[hang][lie] = { "#####    ",
						  "#   #    ",
						  "# @ # ###",
						  "# @ # #&#",//o=[7][3]
						  "### ###&#",
						  " ##    &#",
						  " # @ #  #",
						  " #  o####",
						  " #####   ", };			       /*{ "##########",
														  "#&  @    #",
														  "###  o   #",//a[2][5]=o
														  "#   @    #",
														  "#    #####",
														  "#       &#",
														  "##########" };*/
int b = 0, c = 0;
int e = 7, f = 4;//初始位置
while (1)
{
	if (a[3][7] == ' ')
		a[3][7] = '&';
	if (a[5][7] == ' ')
		a[5][7] = '&';
	if (a[4][7] == ' ')
		a[4][7] = '&';
	system("cls");
	printf("输入r重头开始\n");
	printf("请将'@'推入'&'\n");
	for (b = 0; b <= 8; b++)
		puts(a[b]);
		//printf("%s\n", a[b]);
	char d;
	if (a[3][7] == '@' && a[5][7] == '@' && a[4][7] == '@')
		break;
	d = _getch();
	switch (d)
	{
	case 'r':
		goto out;
	case's':
	{
		if (a[e + 1][f] == '@' && (a[e + 2][f] == ' ' || a[e + 2][f] == '&'))
		{
			a[e + 1][f] = ' ';
			a[e + 2][f] = '@';
		}
		if (a[e + 1][f] != '#' && (a[e + 1][f] == ' ' || a[e + 2][f] == ' ' || a[e + 1][f] == '&' || a[e + 2][f] == '&'))
		{
			if (a[e + 1][f] == '@' && a[e + 2][f] == '#'){
			continue;
			}
			a[e][f] = ' ';
			e++;
			a[e][f] = 'o';
		}break;
	}
	case 'w':
	{
		//if(a[e-1][f]=='@'&&a[e-2][f]=='#')
		if (a[e - 1][f] == '@' && (a[e - 2][f] == ' ' || a[e - 2][f] == '&'))
		{
			a[e - 1][f] = ' ';
			a[e - 2][f] = '@';
		}
		if (a[e - 1][f] != '#' && (a[e - 1][f] == ' ' || a[e - 2][f] == ' ' || a[e - 1][f] == '&' || a[e - 2][f] == '&'))
		{
			if (a[e - 1][f] == '@' && a[e - 2][f] == '#')
				continue;
			a[e][f] = ' ';
			e--;
			a[e][f] = 'o';
		}break;
	}
	case'd':
	{
		if (a[e][f + 1] == '@' && (a[e][f + 2] == ' ' || a[e][f + 2] == '&'))
		{
			a[e][f + 1] = ' ';
			a[e][f + 2] = '@';
		}
		if (a[e][f + 1] != '#' && (a[e][f + 1] == ' ' || a[e][f + 2] == ' ' || a[e][f + 1] == '&' || a[e][f + 2] == '&'))
		{
			if (a[e][f + 1] == '@' && a[e][f + 2] == '#')
				continue;
			a[e][f] = ' ';
			f++;
			a[e][f] = 'o';
		}break;
	}
	case'a':
	{
		if (a[e][f - 1] == '@' && (a[e][f - 2] == ' ' || a[e][f - 2] == '&'))
		{
			a[e][f - 1] = ' ';
			a[e][f - 2] = '@';
		}
		if (a[e][f - 1] != '#' && (a[e][f - 1] == ' ' || a[e][f - 2] == ' ' || a[e][f - 1] == '&' || a[e][f - 2] == '&'))
		{
			if (a[e][f - 1] == '@' && a[e][f - 2] == '#')
				continue;
			a[e][f] = ' ';
			f--;
			a[e][f] = 'o';
		}break;
	}
	}
}printf("you win");
}

